### Retrieving data from MySQL using SQLAlchemy and MySQLConnector

In [2]:
# Importing modules and Libraries

from sqlalchemy import create_engine
import pandas as pd

In [4]:
engine_string="mysql+mysqlconnector://root:root@localhost:3306/eda_assignment_5"
engine=create_engine(engine_string)

In [6]:
query="Select * from SampleFakerData2"
Faker_retrieved_df=pd.read_sql_query(query,con=engine)

In [8]:
Faker_retrieved_df.head()

,customer_id,customer_name,product_id,purchase_date,quantity,price_per_unit,region
0,1000,Rachael Anderson,19,2024-09-22,10,24.92,South
1,1001,Andrew Arnold,4,2023-12-16,3,58.41,East
2,1002,Jason Andersen,4,2024-07-01,7,99.57,South
3,1003,Joanne Collins,18,2024-06-20,5,31.95,North
4,1004,Cristian Cross,19,2024-08-02,4,69.11,East